Thanks for the quick turnaround on v6.7.5.

I can confirm this does resolve the internal validation errors from v6.7.4.  

A new behavior I'm seeing on v6.7.5 is a number of `github_actions_secret` resources that have had no recent changes are showing the need to be force replaced.  This _should_ be safe since they will be overwritten with the same values they already hold, but it's noteworthy.  The apply completed successfully.

```
  # module.infrastructure.github_actions_secret.xxxxxx[0] must be replaced
-/+ resource "github_actions_secret" "xxxxxxx" {
      ~ created_at       = "2024-09-06 20:00:30 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "***************************************************" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-10-31 23:48:21 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.infrastructure.github_actions_secret.yyyyyy[0] must be replaced
-/+ resource "github_actions_secret" "yyyyyyyyy" {
      ~ created_at       = "2023-12-13 20:42:34 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "********************************" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-10-31 23:48:20 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

```

To doublecheck I ran the plan a second time and as you would hope, there are no outstanding changes.

```
No changes. Your infrastructure matches the configuration.
Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```